// การเพิ่ม และ ลบ สมาชิกใน Array
// ตัวอย่างเช่นฟังก์ชัน push, pop, unshift, shift

//////////////////////////////////////////
// .push() เป็นการนำสมาชิกไปเพิ่มต่อท้ายใน Array
const data = [10, 20, 30]
console.log(data);//[ 10, 20, 30 ]

data.push(40)//เพิ่ม 40 ไปต่อท้าย
console.log(data);//[ 10, 20, 30, 40 ]

data.push(...[500, 600, 700])//เพิ่ม 500, 600, 700 ไปต่อท้าย
console.log(data);//[ 10, 20, 30, 40, 500, 600, 700 ]

//////////////////////////////////////////
// .pop() เป็นการนำสมาชิกท้ายสุดใน Array ออก
data.pop()//ลบ 700 ตัวท้ายสุดออก
console.log(data);//[ 10, 20, 30, 40, 500, 600]

data.pop()//ลบ 600 ตัวท้ายสุดออก
console.log(data);//[ 10, 20, 30, 40, 500]

//////////////////////////////////////////
// .unshift() เป็นการนำสมาชิกไปเพิ่มต่อข้างหน้าใน Array
data.unshift(99)//เพิ่ม 9 ไปต่อข้างหน้า
console.log(data);//[ 99, 10, 20, 30, 40, 500 ]

data.shift()//ลบ สมาชิกข้างหน้าออก
console.log(data);//[ 10, 20, 30, 40, 500 ]

// [ 10, 20, 30 ]
// [ 10, 20, 30, 40 ]
// [ 10,  20,  30, 40, 500, 600, 700 ]
// [ 10, 20, 30, 40, 500, 600 ]
// [ 10, 20, 30, 40, 500 ]
// [ 99, 10, 20, 30, 40, 500 ]
// [ 10, 20, 30, 40, 500 ]