// ตัวอย่างฟังก์ชัน Splice & Slice in Array ใช้สำหรับสมาชิกที่อยู่ตำแหน่ง ช่วงที่ต้องการ
// splice(ตำแหน่งที่จะลบ, จำนวนที่จะลบ,สมาชิกที่ต้องการแทรกเข้าไปในตำแหน่งที่ลบ)
// slice(ตำแหน่งเริ่มต้น, ตำแหน่งสุดท้าย-1)

///////////////////////////////////////
const data = [10, 20, 30, 40, 50]
console.log(data);//[ 10, 20, 30, 40, 50 ]

// ต้องการ ลบสมาชิกที่ 20, 30, 40
// data.splice(1,3)//index[1]=20,จำนวนที่จะลบนับตั้งแต่ index[1] ในที่นี้เราจะลบ 3 จำนวน
// console.log(data);//[ 10, 50 ]

///////////////////////////////////////////////////////////////////////
// splice(ตำแหน่งที่จะลบ, จำนวนที่จะลบ,สมาชิกที่ต้องการแทรกเข้าไปในตำแหน่งที่ลบ)
data.splice(1,3,500,600,700)//เป็นการแทรกสมาชิกเข้าไปในตำแหน่งที่ถูกลบไป
console.log(data);//[ 10, 500, 600, 700, 50 ]

//////////////////////////////////////////
const nweData = [100, 200, 300, 400, 500]
console.log(nweData);//[ 100, 200, 300, 400, 500 ]

// ต้องการเรียกใช้สมาชิก 200, 300
/////////////////////////////////////////
// slice(ตำแหน่งเริ่มต้น, ตำแหน่งสุดท้าย-1)
const dataAll = nweData.slice(1,3)//index[1]=200, index[3-1]=index[2]=300
console.log(dataAll);//[ 200, 300 ]

// [ 10, 20, 30, 40, 50 ]
// [ 10, 500, 600, 700, 50 ]
// [ 100, 200, 300, 400, 500 ]
// [ 200, 300 ]
