// Array.(Map) => เป็นการนำเอาค่าสมาชิกใน Array นำมาทำการ Mapค่า หรือทำการเปลี่ยนแปลงค่า และก็สร้างเป็น Array ก้อนใหม่ออกมาใช้งาน

const numbers = [10, 20, 30, 40];
console.log(`number = ${numbers}`); //number = 10,20,30,40

// data ในรูปแบบ Array
const data = [
  "ฝนตก",
  "แดดร้อน",
  "ฝนฟ้าคะนอง",
  "แดดร้อน",
  "ฝนตก",
  "อากาศดี",
  "หมอก",
];
console.log(`data = ${data}`); //data = ฝนตก,แดดร้อน,ฝนฟ้าคะนอง,แดดร้อน,ฝนตก,อากาศดี,หมอก

// ตัวอย่าง เมื่อเราต้องการให้สมาชิกแต่ละตัว * 2
const result = numbers.map((e) => {
  const a = e * 2; // 10*2, 20*2, 30*2, 40*2
  return a;
});
// const result = numbers.map((e)=>e*2 // 10*2, 20*2, 30*2, 40*2

// const result = numbers.map((e)=>e*e // 10*10, 20*20, 30*30, 40*40

// const result = numbers.map((e) => {
//   return e * 2; // 10*2, 20*2, 30*2, 40*2
// });

console.log(`result = ${result}`); //result = 20,40,60,80

// สภาพอากาศในแต่ละวัน
// const resultData = data.map(e=>{
//     return e
// })
// console.log(resultData); //['ฝนตก','แดดร้อน','ฝนฟ้าคะนอง',    'แดดร้อน','ฝนตก','อากาศดี','หมอก']

// const resultData = data.map((e,i) => {
//   return i;
// });
// console.log(resultData);//[0, 1, 2, 3,4, 5, 6]

const resultData = data.map((e, i) => {
  return `วันที่ ${i + 1} มีสภาพอากาศ = ${e}`;
});
console.log(resultData);
// [
//     'วันที่ 1 มีสภาพอากาศ = ฝนตก',
//     'วันที่ 2 มีสภาพอากาศ = แดดร้อน',
//     'วันที่ 3 มีสภาพอากาศ = ฝนฟ้าคะนอง',
//     'วันที่ 4 มีสภาพอากาศ = แดดร้อน',
//     'วันที่ 5 มีสภาพอากาศ = ฝนตก',
//     'วันที่ 6 มีสภาพอากาศ = อากาศดี',
//     'วันที่ 7 มีสภาพอากาศ = หมอก'
//   ]

///////////////console.log()/////////////////////
// number = 10,20,30,40
// data = ฝนตก,แดดร้อน,ฝนฟ้าคะนอง,แดดร้อน,ฝนตก,อากาศดี,หมอก
// result = 20,40,60,80
// [
//   'วันที่ 1 มีสภาพอากาศ = ฝนตก',
//   'วันที่ 2 มีสภาพอากาศ = แดดร้อน',
//   'วันที่ 3 มีสภาพอากาศ = ฝนฟ้าคะนอง',
//   'วันที่ 4 มีสภาพอากาศ = แดดร้อน',
//   'วันที่ 5 มีสภาพอากาศ = ฝนตก',
//   'วันที่ 6 มีสภาพอากาศ = อากาศดี',
//   'วันที่ 7 มีสภาพอากาศ = หมอก'
// ]


// data ในรูปแบบ Object
const dataday = [
    { day: "01/04/2567", weather: "แดดร้อน", temp: 40, },
    { day: "02/04/2567", weather: "ฝนตก", temp: 27, },
    { day: "03/04/2567", weather: "หมอก", temp: 18, },
  ];
  const resultDataday = dataday.map(e=>{
    return e.weather
  })
  console.log(resultDataday);//[ 'แดดร้อน', 'ฝนตก', 'หมอก' ]