//ทำงานกับ String
//1. MultiLine String คือ สามารถทำงานกับข้อความยาวๆได้ โดยการขึ้นบรรทัดใหม่แล้วไม่มีข้อผิดพลาดเกิดขึ้นโดยใช้ `
//2. Interpolation คือ สามารถแทรกตัวแปรลงในพื้นที่ String ได้โดยใช้ ${ ชื่อตัวแปร } ร่วมกับ `

//1. MultiLine String
// address1 สามรถแสดงข้อมูลได้ บรรทัดเดียว "String"
const address1 = "ชื่อลูกค้า : นายอภิชาติ วงตะลา ที่อยู่ 140 ถนนสีหบุรานุกิจ ซอยสีหบุรานุกิจ 2 แขวงมีนบุรี เขตมีนบุรี กรุงเทพมหานคร 10510 เบอร์ติดต่อ : 0962966382"
console.log(address1);
// ชื่อลูกค้า : นายอภิชาติ วงตะลา ที่อยู่ 140 ถนนสีหบุรานุกิจ ซอยสีหบุรานุกิจ 2 แขวงมีนบุรี เขตมีนบุรี กรุงเทพมหานคร 10510 เบอร์ติดต่อ : 0962966382

//////////////////////////////////////////////////
// address2 สามรถแสดงข้อมูลได้ แบบขึ้นบรรทัดใหม่ `String`
const address2 = `ชื่อลูกค้า : นายอภิชาติ วงตะลา 
ที่อยู่ 140 ถนนสีหบุรานุกิจ ซอยสีหบุรานุกิจ 2 แขวงมีนบุรี เขตมีนบุรี กรุงเทพมหานคร 10510 
เบอร์ติดต่อ : 0962966382`
console.log(address2);
// ชื่อลูกค้า : นายอภิชาติ วงตะลา 
// ที่อยู่ 140 ถนนสีหบุรานุกิจ ซอยสีหบุรานุกิจ 2 แขวงมีนบุรี เขตมีนบุรี กรุงเทพมหานคร 10510 
// เบอร์ติดต่อ : 0962966382

/////////////////////////////////////////////////
//2. Interpolation
let customerNamr = "เด็กชายโตโต้"
let tel = "096-296-6382"
let city = "140 แขวงมีนบุรี เขตมีนบุรี กรุงเทพมหานคร 10510"

const address3 = `ชื่อลูกค้า : ${customerNamr}
ที่อยู่ : ${city}
เบอร์ติดต่อ : ${tel}`
console.log(address3);
// ชื่อลูกค้า : เด็กชายโตโต้ 
// ที่อยู่ 140 ถนนสีหบุรานุกิจ ซอยสีหบุรานุกิจ 2 แขวงมีนบุรี เขตมีนบุรี กรุงเทพมหานคร 10510 
// เบอร์ติดต่อ : 096-296-6382